In [12]:
import pandas as pd
data={"Name":["Vishwa","Aman","Sujat"],
     "Roll No": [148,165,130],
      "Salary":[100000,20000,100000]}
df=pd.DataFrame(data)
print(df)

     Name  Roll No  Salary
0  Vishwa      148  100000
1    Aman      165   20000
2   Sujat      130  100000

In [139]:
data=pd.read_csv("C:/Users/raina/OneDrive/Desktop/Online_food_delivery/online_food_delivery_dataset/menu_items.csv")
print(data.head(4))
print(data.tail(2))

   item_id  restaurant_id        item_name   price
0        1             49         Rasgulla  347.79
1        2              7      Gulab Jamun  205.70
2        3              8    Chole Bhature  313.79
3        4             10  Chicken Biryani  106.31
     item_id  restaurant_id     item_name   price
248      249             47  Aloo Paratha  550.71
249      250             16     Pav Bhaji  350.97

In [101]:
print(data.isnull().sum())

item_id          0
restaurant_id    0
item_name        0
price            0
dtype: int64

In [140]:
import pandas as pd
df=pd.read_excel("C:/Users/raina/OneDrive/Desktop/HTML/pr1.xlsx")
print(df)

     Name  Class Gender    Salary
0  Vishwa      6      M  100000.0
1   Sujat      6      M  100000.0
2  Aryahi      4      F   90000.0
3  Viveki      4      F   88000.0
4   Mohit      3      M       NaN
5   Mohit      3      M   78000.0
6   Janit      2    NaN   92000.0
7   Janit      1      M   91000.0

In [141]:
print(df.isnull().sum())

Name      0
Class     0
Gender    1
Salary    1
dtype: int64

In [142]:
print(df.duplicated(["Name"]).sum())

# check for any duplicate value in a row

2

In [143]:
import numpy as np
# print(df.replace(np.nan,"hello")) for fully replacing of nan to hello
# for particular replacement default value type for null we can do
# print(df["Salary"].mean())
df["Salary"]= df["Salary"].replace(np.nan,df["Salary"].mean())
# we can replace 30 k value with mean for no change in data overall after insertion mmean is coming
# something 91285
print(df)
#

     Name  Class Gender         Salary
0  Vishwa      6      M  100000.000000
1   Sujat      6      M  100000.000000
2  Aryahi      4      F   90000.000000
3  Viveki      4      F   88000.000000
4   Mohit      3      M   91285.714286
5   Mohit      3      M   78000.000000
6   Janit      2    NaN   92000.000000
7   Janit      1      M   91000.000000

In [144]:
df["Gender"] = df["Gender"].bfill()
print(df)

     Name  Class Gender         Salary
0  Vishwa      6      M  100000.000000
1   Sujat      6      M  100000.000000
2  Aryahi      4      F   90000.000000
3  Viveki      4      F   88000.000000
4   Mohit      3      M   91285.714286
5   Mohit      3      M   78000.000000
6   Janit      2      M   92000.000000
7   Janit      1      M   91000.000000

In [145]:
# Column transformation
df.loc[(df["Salary"]<90000),"GetsBonus"]="Yes"
df.loc[(df["Salary"]>=90000),"GetsBonus"]="No"
print(df)

     Name  Class Gender         Salary GetsBonus
0  Vishwa      6      M  100000.000000        No
1   Sujat      6      M  100000.000000        No
2  Aryahi      4      F   90000.000000        No
3  Viveki      4      F   88000.000000       Yes
4   Mohit      3      M   91285.714286        No
5   Mohit      3      M   78000.000000       Yes
6   Janit      2      M   92000.000000        No
7   Janit      1      M   91000.000000        No

In [146]:
df["Last Name"]=["Jamwal","Ul","Sharma","Gupta","Bhan","Kar","Jha","Pandita"]
print(df)

     Name  Class Gender         Salary GetsBonus Last Name
0  Vishwa      6      M  100000.000000        No    Jamwal
1   Sujat      6      M  100000.000000        No        Ul
2  Aryahi      4      F   90000.000000        No    Sharma
3  Viveki      4      F   88000.000000       Yes     Gupta
4   Mohit      3      M   91285.714286        No      Bhan
5   Mohit      3      M   78000.000000       Yes       Kar
6   Janit      2      M   92000.000000        No       Jha
7   Janit      1      M   91000.000000        No   Pandita

In [147]:
# firsly store value of last name
last_name=df["Last Name"]
# now drop Last Name
df=df.drop(columns=["Last Name"])
# now insert after first name locn by storing loc of first name first
fname_pos=df.columns.get_loc("Name")
df.insert(loc=fname_pos+1,column="Last Name",value=last_name)
print(df)

# last_pos=df.columns.get_loc("Name")
# df["Last Name"] = last_names
# df.insert(loc=last_pos+1,column="Last Name",value=last_names)

     Name Last Name  Class Gender         Salary GetsBonus
0  Vishwa    Jamwal      6      M  100000.000000        No
1   Sujat        Ul      6      M  100000.000000        No
2  Aryahi    Sharma      4      F   90000.000000        No
3  Viveki     Gupta      4      F   88000.000000       Yes
4   Mohit      Bhan      3      M   91285.714286        No
5   Mohit       Kar      3      M   78000.000000       Yes
6   Janit       Jha      2      M   92000.000000        No
7   Janit   Pandita      1      M   91000.000000        No

In [152]:
data={"Months":["January","Febuary","March","April"]}
a=pd.DataFrame(data)
print(a)
a["Short Months"]=list(map(lambda x:x[0:3],a["Months"]))
print(a)

    Months
0  January
1  Febuary
2    March
3    April
    Months Short Months
0  January          Jan
1  Febuary          Feb
2    March          Mar
3    April          Apr

In [160]:
gp=df.groupby(["Gender","Class"]).agg({"Salary":"mean"})
print(gp)

                     Salary
Gender Class
F      4       89000.000000
M      1       91000.000000
       2       92000.000000
       3       84642.857143
       6      100000.000000